englishsupportsystemapp/app/controllers/answers_controller.rb

  def index
    @exercise_id = params[:exercise_id]
    @question_id = params[:question_id]
    @answers = Answer.where(question_id: @question_id).all
---
SELECT `answers`.* FROM `answers` WHERE `answers`.`question_id` = 2

  def create
    @answer = Answer.new(answer_params)
    @answer.question_id = params[:question_id]

    if @answer.save
---
INSERT INTO `answers` (`content`, `created_at`, `updated_at`, `question_id`, `is_correct`) VALUES ('Quát', '2024-10-03 05:36:07.302415', '2024-10-03 05:36:07.302415', 2, FALSE)

  def edit
    @exercise_id = params[:exercise_id]
    @question_id = params[:question_id]
    @answer = Answer.find(params[:id])
---
SELECT `answers`.* FROM `answers` WHERE `answers`.`id` = 1 LIMIT 1