englishsupportsystemapp/app/controllers/application_controller.rb

SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
---
  def current_user
    @current_user ||= session[:user_id] && User.find_by(id: session[:user_id])