englishsupportsystemapp/app/controllers/courses_controller.rb

INSERT INTO `courses` (`name`, `description`, `level`, `created_at`, `updated_at`) VALUES ('Beginning Pt. 2', 'See you again? Did you enjoy our previous beginning course?', 1, '2024-09-24 15:48:07.930919', '2024-09-24 15:48:07.930919')
---
  def create
    @course = Course.new(course_params)

    if @course.save

SELECT `courses`.* FROM `courses` WHERE `courses`.`id` = 1 LIMIT 1
---
  def show
    @course = Course.find(params[:id])

SELECT `courses`.* FROM `courses` WHERE `courses`.`id` = 1 LIMIT 1
---
  def edit
    @course = Course.find(params[:id])

SELECT `courses`.* FROM `courses` WHERE `courses`.`id` = 1 LIMIT 1
UPDATE `courses` SET `courses`.`description` = 'This is the beginning course for someone who just starts learning English.', `courses`.`updated_at` = '2024-09-24 14:20:24.884035' WHERE `courses`.`id` = 1
---
  def update
    @course = Course.find(params[:id])

    if @course.update(course_params)

SELECT `courses`.* FROM `courses` WHERE `courses`.`id` = 1 LIMIT 1
DELETE FROM `courses` WHERE `courses`.`id` = 2
---
  def destroy
    @course = Course.find(params[:id])
    @course.destroy