englishsupportsystemapp/app/controllers/exercises_controller.rb

  def index
    @exercises = Exercise.all
---
SELECT `exercises`.* FROM `exercises`

  def new
    @exercise = Exercise.new
    @lessons = Lesson.all
---
SELECT `lessons`.* FROM `lessons`

  def create
    @exercise = Exercise.new(exercise_params)

    if @exercise.save
---
INSERT INTO `exercises` (`name`, `exercise_type`, `created_at`, `updated_at`, `lesson_id`) VALUES ('Test 1: What did you learn after this lesson', 'multiple_choice', '2024-09-29 09:36:27.225259', '2024-09-29 09:36:27.225259', 1)

  def show
    @questions = Question.where(exercise_id: params[:id]).all
---
SELECT `questions`.* FROM `questions` WHERE `questions`.`exercise_id` = 1

  def edit
    @exercise = Exercise.find(params[:id])
---
SELECT `exercises`.* FROM `exercises` WHERE `exercises`.`id` = 1 LIMIT 1