englishsupportsystemapp/app/controllers/lessons_controller.rb

  def index
    @lessons = Lesson.all
---
SELECT `lessons`.* FROM `lessons`

  def new
    @lesson = Lesson.new
    @courses = Course.all
---
SELECT `courses`.* FROM `courses`

  def create
    @lesson = Lesson.new(lesson_params)

    if @lesson.save
      redirect_to action: :index
    else
      @courses = Course.all
---
INSERT INTO `lessons` (`name`, `content`, `created_at`, `updated_at`, `course_id`) VALUES ('Unit 0: Daily conversation', '- Hello, Goodbye', '2024-09-26 14:02:18.987538', '2024-09-26 14:02:18.987538', 1)
SELECT `courses`.* FROM `courses`

  def edit
    @lesson = Lesson.find(params[:id])
    @courses = Course.all
---
SELECT `lessons`.* FROM `lessons` WHERE `lessons`.`id` = 2 LIMIT 1
SELECT `courses`.* FROM `courses`

  def update
    @lesson = Lesson.find(params[:id])

    if @lesson.update(lesson_params)
---
SELECT `lessons`.* FROM `lessons` WHERE `lessons`.`id` = 2 LIMIT 1
UPDATE `lessons` SET `lessons`.`name` = 'Unit 1: How to distinguish a verb from different times?', `lessons`.`updated_at` = '2024-09-26 15:12:48.579010' WHERE `lessons`.`id` = 2