englishsupportsystemapp/app/controllers/questions_controller.rb

  def index
    @questions = Question.where(exercise_id: params[:exercise_id]).all
---
SELECT `questions`.* FROM `questions` WHERE `questions`.`exercise_id` IS NULL

  def create
    @question = Question.new(question_params)
    @question.exercise_id = params[:exercise_id]

    if @question.save
---
INSERT INTO `questions` (`name`, `created_at`, `updated_at`, `exercise_id`) VALUES ('....... your name?', '2024-10-01 12:51:12.258489', '2024-10-01 12:51:12.258489', 1)

  def edit
    @question = Question.find(params[:id])
---
SELECT `questions`.* FROM `questions` WHERE `questions`.`id` = 1 LIMIT 1

  def update
    @question = Question.find(params[:id])
---
SELECT `questions`.* FROM `questions` WHERE `questions`.`id` = 1 LIMIT 1

  def destroy
    @question = Question.find(params[:id])
    @question.destroy
---
SELECT `questions`.* FROM `questions` WHERE `questions`.`id` = 2 LIMIT 1
DELETE FROM `questions` WHERE `questions`.`id` = 1