englishsupportsystemapp/app/controllers/questions_controller.rb

  def edit
    @answer = Answer.find(params[:id])
---
SELECT `answers`.* FROM `answers` WHERE `answers`.`id` = 2 LIMIT 1

  def update
    @answer = Answer.find(params[:id])
---
SELECT `answers`.* FROM `answers` WHERE `answers`.`id` = 2 LIMIT 1

  def destroy
    @answer = Answer.find(params[:id])
---
SELECT `answers`.* FROM `answers` WHERE `answers`.`id` = 1 LIMIT 1