englishsupportsystemapp/app/controllers/results_controller.rb

SELECT `results`.* FROM `results`
---
  def index
    @results = Result.all