englishsupportsystemapp/app/controllers/stats_controller.rb

  def index
    @month = request.query_parameters["month"] || Time.now.month
    @year = request.query_parameters["year"] || Time.now.year
    @stats = Course.joins(:enrollments)
                   .select("courses.id", "courses.name", "COUNT(enrollments.id) as quantity")
                   .where("EXTRACT(YEAR FROM enrollments.created_at) = ?", @year.to_i)
                   .where("EXTRACT(MONTH FROM enrollments.created_at) = ?", @month.to_i)
                   .group("courses.id", "courses.name")
---
SELECT `courses`.`id`, `courses`.`name`, COUNT(enrollments.id) as quantity FROM `courses` INNER JOIN `enrollments` ON `enrollments`.`course_id` = `courses`.`id` INNER JOIN `users` ON `users`.`id` = `enrollments`.`user_id` INNER JOIN `enrollments` `enrollments_courses` ON `enrollments_courses`.`course_id` = `courses`.`id` WHERE (EXTRACT(YEAR FROM enrollments.created_at) = '2024') AND (EXTRACT(MONTH FROM enrollments.created_at) = '10') GROUP BY `courses`.`id`, `courses`.`name`