englishsupportsystemapp/app/views/api/courses/index.json.jbuilder

total_courses = Course.count
---
SELECT COUNT(*) FROM `courses`