englishsupportsystemapp/app/views/results/index.html.erb

        <tr>
            <td><%= result.user.last_name%> <%= result.user.first_name%></td>
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 2 LIMIT 1