englishsupportsystemapp/app/controllers/api/apis_controller.rb

    def authenticate
      auth = request.headers["Authorization"]

      if auth
        token = auth.split(" ").last
        payload = JsonWebToken.decode(token)
        if payload["user_id"]
          user = User.find(payload["user_id"])
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 2 LIMIT 1