englishsupportsystemapp/app/controllers/api/courses_controller.rb

SELECT `courses`.* FROM `courses`
SELECT `users`.* FROM `users` WHERE `users`.`id` = 4 LIMIT 1
SELECT COUNT(*) FROM `courses`
SELECT `courses`.* FROM `courses` LIMIT 18446744073709551615 OFFSET 1
---
  def index
    page = request.query_parameters["page"]

    @courses = Course.all

    auth = request.headers["Authorization"]

    if auth
      token = auth.split(" ").last
      payload = JsonWebToken.decode(token)
      if payload["user_id"]
        user = User.find(payload["user_id"])
        @courses = @courses.order(
          Arel.sql("CASE WHEN level = #{ActiveRecord::Base.sanitize_sql(user.english_level)} THEN 0 ELSE 1 END"), :level) if user
      end
    end

    @courses = @courses.limit(page_size)