englishsupportsystemapp/app/controllers/api/users_controller.rb

SELECT `users`.* FROM `users` WHERE `users`.`username` = 'admin' LIMIT 1
---
  def login
    @user = User.find_by(username: params[:username])

INSERT INTO `users` (`first_name`, `email`, `last_name`, `username`, `password_digest`, `role`, `date_of_birth`, `gender`, `english_level`, `created_at`, `updated_at`) VALUES ('user1', 'user@gmail.com', 'user2', 'user', '$2a$12$qQX4g2eTACs6ekwb4VKoD.piSL4xWkLY4ylowO997K3g5/.Ukoh5.', 'user', '2003-02-01', FALSE, 1, '2024-09-29 09:08:46.972526', '2024-09-29 09:08:46.972526')
---
  def register
    @user = User.new(user_params)
    @user.role = "user"

    if @user.save